[
  {
    "id": 1,
    "title": "How I Started in Freelancing",
    "date": "2025-10-22",
    "summary": "From translating and proofreading in Hebrew to earning $1000 per month working a few hours, my experience can guide you to kickstart your freelance journey.",
    "link": "blog/001.html"
  },
  {
    "id": 2,
    "title": "Freelancing Tips for Beginners",
    "date": "2025-10-23",
    "summary": "Learn key strategies to stand out and get clients faster in the competitive world of freelancing.",
    "link": "blog/002.html"
  },
  {
    "id": 3,
    "title": "Top 5 Mistakes New Freelancers Make",
    "date": "2025-10-24",
    "summary": "Avoid common pitfalls like undercharging, overcommitting, and poor client communication to grow your freelance career faster.",
    "link": "blog/003.html"
  },
  {
    "id": 4,
    "title": "How to Build a Freelance Portfolio With No Clients (Yet)",
    "date": "2025-10-25",
    "summary": "Tips on curating your best work, presenting it professionally, and attracting higher-paying clients.",
    "link": "blog/004.html"
  },
  {
    "id": 5,
    "title": "How to Get Your First Freelance Client on Upwork",
    "date": "2025-10-26",
    "summary": "A beginner's guide to landing your first Upwork client quickly through profile optimization, strategic bidding, and excellent delivery.",
    "link": "blog/005.html"
  },
  {
    "id": 6,
    "title": "Finding Your Freelance Niche",
    "date": "2025-10-27",
    "summary": "Discover how to focus on your strengths and specialize to stand out in a crowded market.",
    "link": "blog/006.html"
  },
  {
    "id": 7,
    "title": "Setting Rates as a Freelancer",
    "date": "2025-10-28",
    "summary": "Learn how to price your services fairly, increase rates over time, and communicate value to clients effectively.",
    "link": "blog/007.html"
  },
  {
    "id": 8,
    "title": "Freelancing Tools I Use Every Day",
    "date": "2025-10-29",
    "summary": "A guide to software, apps, and resources that make freelancing easier and more efficient.",
    "link": "blog/008.html"
  },
  {
    "id": 9,
    "title": "How to Handle Difficult Clients",
    "date": "2025-10-30",
    "summary": "Practical advice for maintaining professionalism, setting boundaries, and ensuring smooth project delivery.",
    "link": "blog/009.html"
  },
  {
    "id": 10,
    "title": "Scaling Your Freelance Business",
    "date": "2025-10-31",
    "summary": "Tips on growing your income, automating tasks, and turning freelancing into a sustainable career.",
    "link": "blog/010.html"
  },
  {
  "id": 11,
  "title": "The Freelancer's Lull: What To Do (and What NOT To Do) When Work Dries Up",
  "date": "2025-11-01",
  "summary": "Strategies and tips for managing frustration and anxiety during project lulls without abandoning your long-term freelance strategy.",
  "link": "blog/011.html"
},
  {
    "id": 12,
    "title": "Why Your Rate Hike Didn't Cost You Clients (Yet)",
    "date": "2025-11-02",
    "summary": "The quiet period after raising rates isn't failure; it's filtration. How to survive the lull by understanding the premium market.",
    "link": "blog/012.html"
  },
  {
    "id": 13,
    "title": "Your Medical Degree is Your Price Justification",
    "date": "2025-11-05",
    "summary": "How to leverage your MD student status to justify premium rates and sell risk reduction, not just language services, to HealthTech and Pharma clients.",
    "link": "blog/013.html"
  },
  {
    "id": 14,
    "title": "How to Write a Proposal That Gets Read (The Sniper Method)",
    "date": "2025-11-07",
    "summary": "A step-by-step guide on moving past generic templates to write hyper-targeted proposals that grab attention and eliminate your competition.",
    "link": "blog/014.html"
  },
  {
    "id": 15,
    "title": "Mastering Multitasking (The Student Freelancer's Skill)",
    "date": "2025-11-10",
    "summary": "Forget work-life balance; learn micro-scheduling and time-blocking to successfully juggle rigorous medical studies with urgent freelance deadlines.",
    "link": "blog/015.html"
  },
  {
    "id": 16,
    "title": "Three Ways to Turn Your Portfolio Into a Sales Funnel",
    "date": "2025-11-13",
    "summary": "Stop treating your portfolio as a gallery. Learn how to structure case studies and use 'Before & After' samples to actively guide clients toward hiring you at a premium rate.",
    "link": "blog/016.html"
  }
]
